{
    "sports": [
      {
        "id":"1",
        "title":"WWE legend Torrie Wilson reveals one request she turned down in the ring",
        "subtitle" :"Wilson was inducted into the WWE Hall of Fame in 2019",
        "publisher":"Ryan Gaydos",
        "news":"Pro wrestling legend Torrie Wilson wowed WWE and World Championship Wrestling audiences during the height of her career, as she served as a valet for cruiserweight star Kidman and took part in high-profile storylines with Sable and Dawn Marie.\nWhile Wilson was willing to do whatever it took to get to the top of the wrestling world including participating in a storyline involving her father and Dawn Marie she admitted in a recent interview with Generation Iron Fitness & Bodybuilding there was one request she stopped short of fulfilling.\n(I was in an era that was very raunchy,) Wilson explained when talking about having a good character and not worrying about doing (certain things) for a large number of social media followers.\n(There were things I had to say ‘no’ to. They wanted me to paint, like what Sable did. Paint my boobs and walk out there naked. And I said, ‘no.’ There are certain things that I turned down that maybe could’ve gotten ahead with but it just didn’t feel right.\nWilson, 47, retired from full-time wrestling in 2008 but has made sporadic appearances for WWE over the last few years. She was inducted into the WWE Hall of Fame in 2019 and married her current husband Justin Tupper the same year.\nWilson also has a major competitive bodybuilding background. She won Miss Galaxy and was the Tri-Fitness Grace and Physique champion in 1998.\nOutside the ring, she has previously been on the cover of FHM and Playboy magazine and had a relationship with former New York Yankees star Alex Rodriguez.)",
        "pictureId":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/11/896/500/Torrie-Wilson.jpg?ve=1&tl=1",
        "genre":"WWE",
        "time":"November 9, 2022 6:42am"
        
      },
      {
        "id":"2",
        "title":"Isiah Thomas reignites beef with Michael Jordan over 'The Last Dance' portrayal",
        "subtitle" :"Part of the beef stems from the Chicago Bulls and Detroit Pistons rivalry",
        "publisher":"Ryan Gaydos",
        "news":"Isiah Thomas reignited his feud with Michael Jordan on Tuesday as he talked about how he was portrayed in 2020’s 'The Last Dance' documentary.\nOne portion of the documentary talked about the Chicago Bulls’ rivalry with the Detroit Pistons and the 'Bad Boys' era of their franchise. Thomas, Joe Dumars, Bill Laimbeer and Dennis Rodman were among those tasked to get under Jordan’s skin in the Eastern Conference playoffs.\nDuring one episode, Jordan and Thomas both spoke about the Pistons walking off the court early when the Bulls finally got past them. Both competitors appeared to still be stung by the entire situation. Even more than two years after the documentary aired, Thomas appeared to still be annoyed by how he was portrayed.\n'When I was watching ‘The Last Dance,’ I’m (sitting) there and I’m watching it with my family and I’m thinking everything is good,' Thomas explained to Greece’s COSMOTE TV, via Eurohoops.\n'And then this guy comes on television and he says that he hates me and then he calls me an a--hole. And then I proceed to watch a whole documentary about him being an a--hole. I’m like wait a minute, time out. Until I get a public apology, this beef is gonna go on for a long, long time, cause I’m from the west side of Chicago.'\nIn the documentary, Thomas defended the move, saying it was the same thing the Boston Celtics did to them during the 1988 conference finals. He said he did not understand the outcry.\n'To us, that was OK,' Thomas said. 'Knowing what we know now and the aftermath that took place, I think all of us would have stopped and said congratulations like they do now.'\nThomas said it was different from today’s game.\n'I mean, we would have did it. Of course, we would have done it,' he said of shaking hands after the game. 'But during that period of time, that's just not how [the mantle] was passed. When you lost, you left the floor. That's it.'\nJordan was not thrilled with Thomas’ explanation in the episode. When he was shown what Thomas said, Jordan scoffed.\n'Whatever he says now, you know it wasn't his true actions then. He's had time enough to think about it -- or the reaction of the public that's kind of changed his perspective of it. You can show me anything you want. There's no way you're going to convince me he wasn't an a--hole,'' he said.",
        "pictureId":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/11/672/378/Isiah-Thomas2.jpg?ve=1&tl=1", 
        "genre":"Basket Ball",
        "time":"November 9, 2022 7:22am"
      },
      {
        "id":"3",
        "title":"Aaron Judge among MVP award finalists after record-setting season",
        "subtitle" :"Paul Goldschmidt highlights National League finalists",
        "publisher":"Scott Thompson",
        "news":"For the AL, New York Yankees slugger Aaron Judge is the leader of the pack and is the likely winner of the award after resetting the single-season AL home run record with 63 blasts, his final coming at Globe Life Park against the Texas Rangers.\nBut Los Angeles Angels superstar Shohei Ohtani continues to do things that have never been seen in the game. The 28-year-old pitched his way to a 2.33 ERA in 28 starts for the Angels, while hitting .273/.356/.519 with 34 homers and 95 RBI in 157 games.\nHe’s the reigning AL MVP after belting 46 homers and notching 100 RBI with a 3.18 ERA in 23 starts last season. While many believe Judge has the MVP locked up – he won the Players’ Choice Award for the American League’s Outstanding Player – Ohtani’s production on both sides makes him hard to count out.\nAnd then there’s the 2022 World Series champion: Houston Astros slugger Yordan Alvarez. The lefty had 37 homers for the second-most in the AL with 97 RBI. He and Judge were the only hitters to post an OPS over 1.000, too, as Alvarez finished at 1.019 with a 187 OPS+ (league average is 100).\nFor the National League, Paul Goldschmidt leads the way, and while Ohtani gives Judge a run for the award, no one in the NL is expected to top the St. Louis Cardinals first baseman.\nHe was chasing the Triple Crown in the NL for quite some time, eventually losing out in the average category. But he still had a .317 average with 35 homers and 115 RBI. He led the NL in slugging (.578) and OPS (.981) as well.\nGoldschmidt's Cardinals teammate, Nolan Arenado, is also in the running. Collecting his 10th consecutive Gold Glove, Arenado also hit 30 homers with a .293 average and 102 RBI for St. Louis. While getting three top-five finishes, Arenado has never won the award.\nManny Machado of the San Diego Padres rounds out the bunch with his .298 average and 32 homers. He was a key factor that helped the Padres get to the NLCS, which they would eventually lose to the Philadelphia Phillies.\nThe finalists must wait until Nov. 17 to hear the outcome.\nThe other MLB awards, which are the Cy Young Awards (Nov. 16), Managers of the Year (Nov. 15) and Jackie Robinson Rookies of the Year (Nov. 14), will also be made next week.",
        "pictureId":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/672/378/GettyImages-1430828552.jpg?ve=1&tl=1",
        "genre":"Baseball",
        "time":"November 7, 2022 8:57pm"
      },
      {
        "id":"4",
        "title":"Novak Djokovic points to 'positive signs' ahead of Australian Open 2023: 'I just want to play tennis'",
        "subtitle" :"Djokovic says he hopes to have an answer 'in the next few weeks'",
        "publisher":" Paulina Dedaj",
        "news":"Novak Djokovic says he hopes to have an answer regarding his participation at the Australian Open 'in the next few weeks,' adding that there are 'some positive signs,' despite facing a potential three-year ban after being deported earlier this year over his vaccine status.\nSpeaking to Sportal, the 21-time Grand Slam champion said his legal team has been in talks with Australian governmental officials regarding his deportation, which made him subject to a three-year ban.\n'When it comes to Australia, there are some positive signs, but unofficially,'' he told the outlet, via EuroSport. 'We are communicating through my lawyers in Australia. In fact, they are communicating with the authorities in charge of my case.\n' I hope to have an answer in the next few weeks – whatever that answer might be, but, of course, I am hoping for a positive one – so that I have enough time to prepare for the start of the season, if that start is going to happen in Australia.'\nDjokovic traveled to Australia in January to defend his title under the impression that he had been granted a medical exemption to the government’s mandate that all travelers must be vaccinated against COVID-19.\nThe exemption was rejected by the Australian Border Force upon his arrival in Melbourne and, after several days of a back-and-forth in the courts, his visa was revoked, and he was deported.\n'I really want to go there. I am over what happened this year, and I just want to play tennis. It is what I do best,'' Djokovic added. 'Australia has always been the place where I have played my best tennis. The results speak for themselves, so I am always extra motivated to go there. This time even more so.'\nThe mandate in Australia was lifted over the summer, but the deportation could prevent him from traveling back.\n'It is not a matter we can lobby on. It is a matter that definitely stays between the two of them,'' Australian Open tournament director Craig Tiley said earlier this month of Djokovic and the Australian government.\n'And then, depending on the outcome, we would welcome him to the Australian Open.'\nDjokovic was unable to play in the U.S. Open in August because of a similar mandate for non-U.S. citizen travelers. He defended his decision not to get vaccinated in September, saying he was well aware of the consequences.\n'I don’t have any regrets. I mean, I do feel sad that I wasn’t able to play, but that was a decision that I made, and I knew what the consequences would be,'' he said at the Laver Cup. 'So I accepted them, and that’s it.'",
        "pictureId":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/08/672/378/Novak-Djokovic4.jpg?ve=1&tl=1",
        "genre":"Tennis",
        "time":"October 25, 2022 5:48pm"
      },
      {
        "id":"5",
        "title":"WWE star R-Truth suffers torn quad in dive attempt during NXT match",
        "subtitle" :"R-Truth was facing off against Grayson Waller in the match last week",
        "publisher":"Ryan Gaydos",
        "news":"WWE star R-Truth revealed in a message to fans on Tuesday he suffered a torn quad during a match on NXT against Grayson Waller last week.\nR-Truth, whose real name is Ron Killings, said in a video he suffered a torn quad and will likely be out for several months as he goes through rehab in order to get back to the ring.\n'It is what it is, right? Y’all know I’ll be back,' he said in the video from the hospital parking lot ahead of his procedure. 'I want to thank you. Without you, ain’t no me. So let me go ahead and handle this business, and I’ll be back before y’all know it. Alright? Peace.\nR-Truth and Waller had been feuding recently on the NXT brand, and it culminated in a match last week.\nDuring their match, the 50-year-old bounced off the ropes and went for a dive on Waller. He did a backflip toward Waller and went down hard on the mat outside the ring. He immediately grabbed his left leg and appeared to be in serious pain.\nR-Truth has been in the pro wrestling business since the late 90s. The premiered for WWE (then-WWF) in 1999 as K-Kwik alongside Road Dogg. He eventually made his way to Total Nonstop Action before returning to WWE in 2008.\nHe has been a WWE United States champion, WWE Hardcore champion, WWE 24/7 champion and WWE Tag-Team champion at various points of his career.",
        "pictureId":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/11/672/378/R-Truth.jpg?ve=1&tl=1",
        "genre":"WWE",
        "time":"November 9, 2022 8:20am"
      },
      {
      "id":"6",
      "title":"Kyrie Irving is most hated player in the NBA, new data shows",
      "subtitle":"Irving is suspended for antisemitic controversy",
      "publisher":"Ryan Morik",
      "news":"The Booklyn Nets' Kyrie Irving has not won over many people with his latest controversy. In fact, data shows he's done the opposite. According to betonline.ag, Irving is now the most hated player in the NBA.The site tracked over 100,000 tweets with phrases that including 'I hate Kyrie,' 'I hate LeBron [James],'' and other similar tweets to see who fans hated the most.\nTwenty-eight states hate Irving more than anyone else in the NBA, including New York, the state where he plays.\nIrving is suspended after he tweeted a link to an antisemitic film and was unapologetic about it. The Brooklyn Nets deemed him 'unfit to be associated' with the team.\nBrooklyn has given the guard a six-part to-do list he must complete to return to the team, which includes donations and trainings. Irving also issued an apology for the tweet, satisfying one of the team's demands.Irving also reportedly met with NBA Commissioner Adam Silver Tuesday in a 'productive and understanding visit.'Irving has since been criticized by some big-time celebrities, including his former teammate James, as well as Shaquille O'Neal and Howard Stern. O'Neal called Irving an 'idiot,'' while Stern called Irving a 'f---ing moron.'\nJames ranks second with 17 states disliking him the most. Ben Simmons is the most hated in three states: his former home of Pennsylvania, New Jersey and Delaware. Kevin Durant (Ohio) and Draymond Green (Arizona) each took home one state.",
      "pictureId":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/288/162/GettyImages-1244281520.jpg?ve=1&tl=1",
      "genre":"NBA",
      "time":"November 9, 2022 6:26pm"
      }
    ]
  }